Merge branch 'dev' into 'main'
chore: remove airflow reference code folder

See merge request de-team/hanas-docs!3
